<?php 
$fake_year = 2033; //2033年を一時的に仮定してシステムを動かしてる(深い理由はないです....)

$semesters = [1 => '前期',2 => '後期'];

$role = [1 => 'SA', 2 => 'TA' ];

$school_grade = [
	1 => '学部1年生', 
	2 => '学部2年生',
	3 => '学部3年生',
	4 => '学部4年生',
	5 => '大学院1年生',
	6 => '大学院2年生'
];

$grade = [
	1 => 'S', 
	2 => 'A',
	3 => 'B',
	4 => 'C',
	5 => 'D',
	6 => 'E'
];

$weekdays = [	
	1 => '月曜日',
	2 => '火曜日',
	3 => '水曜日',
	4 => '木曜日',
	5 => '金曜日',
	6 => '土曜日',
	7 => '日曜日'
];

$weekdays_sm = [	
	1 => '月',
	2 => '火',
	3 => '水',
	4 => '木',
	5 => '金',
	6 => '土',
	7 => '日'
];

$times = [
	1 => '1限',
	2 => '2限',
	3 => '3限',
	4 => '4限',
	5 => '5限',
	6 => '6限'
];

$ques = [
	0 => '特になし', 
	1 => '当てはまる', 
	2 => 'やや当てはまる', 
	3 => 'どちらでもない', 
	4 => 'やや当てはまらない', 
	5 => '当てはまらない' 
];

$sex = [
	1 => '男性',
	2 => '女性'
]



// if($value['rcm_result'] == 1){
// 				  		$result = '受領';
// 				  	}
// 				  	if($value['rcm_result'] == 2){
// 				  		$result = '拒否';








 ?>